{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 16, "b_constraint": null, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "same", "name": "convolution2d_1", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 32, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "same", "name": "convolution2d_2", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "dense_1", "output_dim": 100, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "dense_2", "output_dim": 75, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "dense_3", "output_dim": 50, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null}}]}