{"config": [{"config": {"W_constraint": null, "batch_input_shape": [null, 64, 64, 3], "subsample": [1, 1], "activation": "linear", "init": "glorot_uniform", "border_mode": "same", "input_dtype": "float32", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 16, "nb_row": 3, "bias": true, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "bias": true, "nb_filter": 32, "nb_row": 3, "b_constraint": null, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "input_dim": null, "activation": "linear", "output_dim": 200, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "input_dim": null, "activation": "linear", "output_dim": 100, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "input_dim": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}