{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 64, 64, 3], "b_regularizer": null, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "same", "W_constraint": null, "name": "convolution2d_1", "nb_col": 3, "nb_filter": 16, "input_dtype": "float32", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "same", "W_constraint": null, "name": "convolution2d_2", "nb_col": 3, "nb_filter": 32, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 200, "W_constraint": null, "input_dim": null, "name": "dense_1", "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "W_constraint": null, "input_dim": null, "name": "dense_2", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "W_constraint": null, "input_dim": null, "name": "dense_3", "bias": true}}], "keras_version": "1.1.2"}