{"keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 16, "nb_col": 3, "activation": "linear", "input_dtype": "float32", "name": "convolution2d_1", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 32, "nb_col": 3, "activation": "linear", "name": "convolution2d_2", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 75}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "b_constraint": null, "trainable": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 1}}], "class_name": "Sequential"}