{"config": [{"config": {"bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "input_dtype": "float32", "nb_filter": 16, "activity_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "nb_col": 3, "W_constraint": null, "nb_row": 3, "batch_input_shape": [null, 64, 64, 3], "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 32, "activity_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "nb_col": 3, "W_constraint": null, "nb_row": 3, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 200, "b_constraint": null, "W_constraint": null, "activation": "linear", "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_2", "b_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "W_constraint": null, "activation": "linear", "input_dim": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_3", "b_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "W_constraint": null, "activation": "linear", "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}